---
type: IStructuralSectionsServer
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# IStructuralSectionsServer

`Autodesk.Revit.DB.Structure.IStructuralSectionsServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | StructuralSectionsUpdate | 2015 | `bool StructuralSectionsUpdate ( StructuralSectionsServiceData data )` |